## Exercises I

In [1]:
import pandas as pd
import numpy as np
import env

Use your function to obtain a connection to the employees database.

In [4]:
pd.read_sql('SELECT * FROM employees LIMIT 5', env.get_db_url('employees'))

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

a. Intentionally make a typo in the database url. What kind of error message do you see?

In [ ]:
# There is an access denied message becasue of the mispelled db name
pd.read_sql('SELECT * FROM employees LIMIT 5', env.get_db_url('employes'))

b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
# it says I have an error in my sql syntax
pd.read_sql('SELECT * FROM employees LMIT 5', env.get_db_url('employees'))

Read the employees and titles tables into two separate DataFrames.

In [10]:
emp_df = pd.read_sql('SELECT * FROM employees', env.get_db_url('employees'))

In [12]:
titles_df = pd.read_sql('SELECT * FROM titles', env.get_db_url('employees'))

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [13]:
emp_df.shape

(300024, 6)

In [14]:
titles_df.shape

(443308, 4)

Display the summary statistics for each DataFrame.

In [44]:
emp_df.describe(), emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

(              emp_no
 count  300024.000000
 mean   253321.763392
 std    161828.235540
 min     10001.000000
 25%     85006.750000
 50%    249987.500000
 75%    424993.250000
 max    499999.000000,
 None)

In [45]:
titles_df.info(), titles_df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

(None,
               emp_no
 count  443308.000000
 mean   253075.034430
 std    161853.292613
 min     10001.000000
 25%     84855.750000
 50%    249847.500000
 75%    424891.250000
 max    499999.000000)

How many unique titles are in the titles DataFrame?

In [21]:
len(titles_df.title.unique())

7

In [38]:
len(titles_df.title.value_counts())

7

What is the oldest date in the to_date column?

In [24]:
titles_df.to_date.min()

datetime.date(1985, 3, 1)

What is the most recent date in the to_date column?

In [36]:
# including currrently employed
titles_df.to_date.max()

datetime.date(9999, 1, 1)

In [35]:
# excluding currently employed people
titles_df.to_date[titles_df.to_date != titles_df.to_date.max()].max()

datetime.date(2002, 8, 1)

## Exercises II

In [ ]:
Copy the users and roles DataFrames from the examples above.

In [ ]:
What is the result of using a right join on the DataFrames?

In [ ]:
What is the result of using an outer join on the DataFrames?

In [ ]:
What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
Load the mpg dataset from PyDataset.

In [ ]:
Output and read the documentation for the mpg dataset.

In [ ]:
How many rows and columns are in the dataset?

In [ ]:
Check out your column names and perform any cleanup you may want on them.

## Exercises III

Use your get_db_url function to help you explore the data from the chipotle database.

What is the total price for each order?

What are the most popular 3 items?

Which item has produced the most revenue?

Join the employees and titles DataFrames together.

For each title, find the hire date of the employee that was hired most recently with that title.

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)